feat: groovy! (gruvbox theme and mermaid diagrams
